Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.edge-aws.module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
+ resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.edge-aws.module.eks.aws_security_group_rule.workers_ingress_self[0] will be created
+ resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.edge-aws.module.eks.kubernetes_config_map.aws_auth[0] will be created
+ resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.edge-aws.module.eks.local_file.kubeconfig[0] will be created
+ resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_test"
      + id                   = (known after apply)
    }

  # module.edge-aws.module.rds_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
+ resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "PostgreSQL access from within edge EKS cluster"
      + from_port                = 5432
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = "sg-0acd1176c4408dfff"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.edge-aws.module.redis[0].aws_elasticache_parameter_group.default[0] will be created
+ resource "aws_elasticache_parameter_group" "default" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "redis6.x"
      + id          = (known after apply)
      + name        = "test"
      + tags_all    = (known after apply)

      + parameter {
          + name  = "cluster-enabled"
          + value = "yes"
        }
      + parameter {
          + name  = "reserved-memory-percent"
          + value = "10"
        }
    }

  # module.edge-aws.module.redis[0].aws_elasticache_replication_group.default[0] will be created
+ resource "aws_elasticache_replication_group" "default" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = true
      + auto_minor_version_upgrade     = true
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + engine                         = "redis"
      + engine_version                 = "6.x"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = "wed:03:00-wed:04:00"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = "cache.r6g.large"
      + number_cache_clusters          = (known after apply)
      + parameter_group_name           = "test"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replication_group_description  = "test"
      + replication_group_id           = "test"
      + security_group_ids             = [
          + "sg-0f7fcd4dc7801f83e",
        ]
      + security_group_names           = (known after apply)
      + snapshot_retention_limit       = 0
      + snapshot_window                = "06:30-07:30"
      + subnet_group_name              = "test"
      + tags                           = {
          + "Name"      = "test"
          + "Terraform" = "true"
        }
      + tags_all                       = {
          + "Name"      = "test"
          + "Terraform" = "true"
        }
      + transit_encryption_enabled     = false

      + cluster_mode {
          + num_node_groups         = 3
          + replicas_per_node_group = 0
        }
    }

  # module.edge-aws.module.redis[0].aws_elasticache_subnet_group.default[0] will be created
+ resource "aws_elasticache_subnet_group" "default" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "test"
      + subnet_ids  = [
          + "subnet-052527a46c990ab50",
          + "subnet-056b2d117aae27a9d",
          + "subnet-0ab204fa0509ffd71",
        ]
      + tags_all    = (known after apply)
    }

  # module.edge-aws.module.eks.module.fargate.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.edge-aws.module.rds[0].module.db_instance.aws_db_instance.this[0] will be created
+ resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 1000
      + allow_major_version_upgrade           = false
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 14
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "edge-20220627064144367600000003"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "13.4"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "edge"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.m5.large"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "sun:00:00-sun:03:00"
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + name                                  = "edge"
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "edge-20220627064131572100000001"
      + password                              = (sensitive value)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = 5432
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Name"      = "edge"
          + "Terraform" = "true"
        }
      + tags_all                              = {
          + "Name"      = "edge"
          + "Terraform" = "true"
        }
      + timezone                              = (known after apply)
      + username                              = "edge"
      + vpc_security_group_ids                = [
          + "sg-0acd1176c4408dfff",
        ]

      + timeouts {
          + create = "40m"
          + delete = "40m"
          + update = "80m"
        }
    }

  # module.edge-aws.module.rds[0].module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
+ resource "aws_iam_role" "enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test-monitoring"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"      = "test-monitoring"
          + "Terraform" = "true"
        }
      + tags_all              = {
          + "Name"      = "test-monitoring"
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.edge-aws.module.rds[0].module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
+ resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "test-monitoring"
    }

  # module.edge-aws.module.redis[0].module.security_group.aws_security_group_rule.default["egress--1-0-65535-9c87e5e1ed040a443ce1ac8e6d6cf159"] will be created
+ resource "aws_security_group_rule" "default" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = "sg-0f7fcd4dc7801f83e"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.edge-aws.module.redis[0].module.security_group.aws_security_group_rule.default["ingress--1-0-65535-2f9a2d36245ef270e7cdc03d16dd9bf8"] will be created
+ resource "aws_security_group_rule" "default" {
      + cidr_blocks              = (known after apply)
      + description              = "Allow all inbound traffic from trusted Security Groups"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = (known after apply)
      + prefix_list_ids          = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = "sg-0f7fcd4dc7801f83e"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

Plan: 56 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ endpoint_address = (known after apply)
+ vpc_id           = "vpc-074e9440b1337f492"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d examples/aws`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=identiq-protocol%252Fedge-infrastructure%252Fexamples%252Faws%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d examples/aws`
</details>
Plan: 56 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
